_Rarzrabotki/Kazna/DataProcessors/ПомощникУстановкиЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ПомощникУстановкиЛимитов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/СчетаПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СчетаПоставщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаОплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВКБ</Name>
					<Comment>Движение по заявке, если она по счету на оплату поставщику (+дата документа, "-" дата платежа)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ЗаявкиНаРасходованиеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРасходованиеДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ЛимитыДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыДДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/Визы_Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Визы_Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВизировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженаВКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплаченоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСКомментариями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденПоСхеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноСКомментарием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/УстановкаЛимитовСтатейДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УстановкаЛимитовСтатейДвиженияДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛимитыДДС</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/ПомощникУстановкиЛимитов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ДобавитьСтрокуГруппировкиИерархия(Строки, Значение, ИндексОформления = 0)
	
	Для Каждого Строка Из Строки Цикл
		Если Строка.Группировка=Значение Тогда
			Возврат Строка;
		КонецЕсли; 
	КонецЦикла; 
	
	НоваяСтрока = Строки.Добавить();
	НоваяСтрока.ИндексОформления = ИндексОформления;
	НоваяСтрока.Группировка = Значение;
	НоваяСтрока.СтандартнаяКартинка = БиблиотекаКартинок.Реквизит;
	Возврат НоваяСтрока;
		
КонецФункции

&НаСервере
Функция ДобавитьСтрокуИерархия(Знач РодительСтрок, СсылкаНаОбъект, ИндексОформления)
	
	Массив = Новый Массив;
	Родитель = СсылкаНаОбъект.Родитель;
	Пока ЗначениеЗаполнено(Родитель) Цикл
		Массив.Вставить(0, Родитель);
		Родитель = Родитель.Родитель;
	КонецЦикла;
	
	Для Каждого Строка Из Массив Цикл
		РодительСтрок = ДобавитьСтрокуГруппировкиИерархия(РодительСтрок, Строка, ИндексОформления).ПолучитьЭлементы();
	КонецЦикла;
	
	Возврат ДобавитьСтрокуГруппировкиИерархия(РодительСтрок, СсылкаНаОбъект, ИндексОформления);
		
КонецФункции

&НаСервере
Функция ПросуммироватьРекурсивно(ЭлементыДерева, Колонка)
	
	Если ЭлементыДерева.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Сумма = 0;
	Для Каждого Строка Из ЭлементыДерева Цикл
		Результат = ПросуммироватьРекурсивно(Строка.ПолучитьЭлементы(), Колонка);
		Если Результат<>Неопределено Тогда
			Строка[Колонка] = Результат;
		КонецЕсли; 
		Сумма = Сумма + Строка[Колонка];
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтрокуДеталейКлиент(Строка)
	
	Лимит = Строка.Лимит;
	Сумма = Строка.Утверждено + Строка.КУтверждению + Строка.КОплате;
	Если Лимит<Сумма Тогда
		Строка.СуммаПрофицит = 0;
		Строка.СуммаДефицит = Сумма-Лимит;
	Иначе
		Строка.СуммаПрофицит = Лимит - Сумма;
		Строка.СуммаДефицит = 0;		
	КонецЕсли; 
	Строка.Отклонение = Строка.Лимит - Строка.ТекущийЛимит;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Результат.Ссылка,
	|	Результат.Организация,
	|	Результат.Подразделение,
	|	Результат.СтатьяДвиженияДенежныхСредств,
	|	Результат.КУтверждению,
	|	Результат.Утверждено,
	|	Результат.КОплате,
	|	Результат.ТекущийЛимит
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Ссылка КАК Ссылка,
	|		Док.Организация КАК Организация,
	|		Док.Подразделение КАК Подразделение,
	|		Док.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		Док.СуммаДокумента КАК КУтверждению,
	|		0 КАК Утверждено,
	|		0 КАК КОплате,
	|		0 КАК ТекущийЛимит
	|	ИЗ
	|		Документ.СчетНаОплатуПоставщика КАК Док
	|	ГДЕ
	|		Док.Виза_Состояние = &Виза_Состояние
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Док.СчетНаОплатуПоставщика,
	|		Док.СчетНаОплатуПоставщика.Организация,
	|		Док.СчетНаОплатуПоставщика.Подразделение,
	|		Док.СчетНаОплатуПоставщика.СтатьяДвиженияДенежныхСредств,
	|		0,
	|		Док.СуммаОстаток,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.СчетаПоставщиков.Остатки КАК Док
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Док.ЗаявкаНаРасходованиеДС,
	|		Док.ЗаявкаНаРасходованиеДС.Организация,
	|		Док.ЗаявкаНаРасходованиеДС.Подразделение,
	|		Док.ЗаявкаНаРасходованиеДС.СтатьяДвиженияДенежныхСредств,
	|		0,
	|		0,
	|		Док.СуммаОстаток,
	|		0
	|	ИЗ
	|		РегистрНакопления.ЗаявкиНаРасходованиеДС.Остатки КАК Док
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		NULL,
	|		Док.Организация,
	|		Док.Подразделение,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		СУММА(Док.СуммаОстаток)
	|	ИЗ
	|		РегистрНакопления.ЛимитыДДС.Остатки КАК Док
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Док.Подразделение,
	|		Док.Организация) КАК Результат
	|ГДЕ
	|	Результат.Подразделение В ИЕРАРХИИ(&Подразделение)"
	);
	
	Если СписокПодразделений.Количество()=0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Результат.Подразделение В ИЕРАРХИИ(&Подразделение)", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Подразделение", СписокПодразделений); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Виза_Состояние", Перечисления.Визы_Состояния.НаВизировании); 
	ТекущиеСчета = Запрос.Выполнить().Выгрузить();
		
	ДеревоДанных.ПолучитьЭлементы().Очистить();
	СтруктураГруппировки = Новый Структура(СтрокаГруппировки);
	
	Для Каждого Строка Из ТекущиеСчета Цикл
		
		СтрокаРодителя = ДеревоДанных;
		ИндексОформления = 1;
		Для Каждого Группа Из СтруктураГруппировки Цикл
			СтрокаРодителя = ДобавитьСтрокуИерархия(СтрокаРодителя.ПолучитьЭлементы(), Строка[Группа.Ключ], ИндексОформления);
			ИндексОформления = ИндексОформления + 1;
		КонецЦикла;

		СтрокаРодителя.МожноУстанавливатьЛимит = Истина;
		ЗаполнитьЗначенияСвойств(СтрокаРодителя, Строка, "Организация, Подразделение");
		
		Если Строка.ТекущийЛимит<>0 Тогда
			СтрокаРодителя.ТекущийЛимит = Строка.ТекущийЛимит;
		КонецЕсли;
		СтрокаРодителя.Лимит = СтрокаРодителя.ТекущийЛимит;
		
		Если Не ЗначениеЗаполнено(Строка.Ссылка) Тогда
			Продолжить;
		КонецЕсли; 
				
		НоваяСтрока = СтрокаРодителя.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Группировка = Строка.Ссылка;
		НоваяСтрока.СтандартнаяКартинка = БиблиотекаКартинок.Документ;
		НоваяСтрока.ЭтоДетали = Истина;
		НоваяСтрока.Лимит = НоваяСтрока.ТекущийЛимит;
		НоваяСтрока.МожноУстанавливатьЛимит = Истина;
		Лимит = НоваяСтрока.Лимит;
		Сумма = НоваяСтрока.Утверждено + НоваяСтрока.КУтверждению + НоваяСтрока.КОплате;
		Если Лимит<Сумма Тогда
			НоваяСтрока.СуммаПрофицит = 0;
			НоваяСтрока.СуммаДефицит = Сумма-Лимит;
		Иначе
			НоваяСтрока.СуммаПрофицит = Лимит - Сумма;
			НоваяСтрока.СуммаДефицит = 0;		
		КонецЕсли; 
		
	КонецЦикла;
	
	ПросуммироватьРекурсивно(ДеревоДанных.ПолучитьЭлементы(), "Лимит");
	ПросуммироватьРекурсивно(ДеревоДанных.ПолучитьЭлементы(), "КУтверждению");
	ПросуммироватьРекурсивно(ДеревоДанных.ПолучитьЭлементы(), "Утверждено");
	ПросуммироватьРекурсивно(ДеревоДанных.ПолучитьЭлементы(), "КОплате");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаГруппировки = "Подразделение";
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросуммироватьПодчиненные(РодительСтроки, ИмяКолонки = "Лимит")
	
	Пока РодительСтроки<>Неопределено Цикл
		Сумма = 0;
		МассивСтрок = РодительСтроки.ПолучитьЭлементы();
		Для Каждого Строка Из МассивСтрок Цикл
			Сумма = Сумма + Строка[ИмяКолонки];
		КонецЦикла;
		РодительСтроки[ИмяКолонки] = Сумма;
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхЛимитПриИзменении(Элемент)
	
	ОбновитьСтрокуДеталейКлиент(Элементы.ДеревоДанных.ТекущиеДанные);
	ПросуммироватьПодчиненные(Элементы.ДеревоДанных.ТекущиеДанные.ПолучитьРодителя());
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьВТаблицу(Таблица, ВходящаяСтрока)
	
	МассивСтрок = ВходящаяСтрока.ПолучитьЭлементы();
	Для Каждого Строка Из МассивСтрок Цикл
		ПреобразоватьВТаблицу(Таблица, Строка);
		Если Не Строка.МожноУстанавливатьЛимит Тогда
			Продолжить;
		КонецЕсли; 
		Если Строка.Лимит=Строка.ТекущийЛимит Тогда
			Продолжить;
		КонецЕсли; 
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЛимитыНаСервере()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Родитель");
	Таблица.Колонки.Добавить("Подразделение");
	Таблица.Колонки.Добавить("Лимит");
	Таблица.Колонки.Добавить("ТекущийЛимит");
	ПреобразоватьВТаблицу(Таблица, ДеревоДанных);
	Для Каждого Строка Из Таблица Цикл
		Строка.Родитель = Строка.Подразделение.Родитель;
	КонецЦикла;
	
	ТаблицаГруппировки = Таблица.Скопировать(,"Родитель");
	ТаблицаГруппировки.Свернуть("Родитель");
	МассивГрупп = ТаблицаГруппировки.ВыгрузитьКолонку("Родитель");
	
	Для Каждого Группа Из МассивГрупп Цикл
		
		ЭтаДата = ТекущаяДата();
		
		ДокументОбъект = Документы.УстановкаЛимитовСтатейДвиженияДенежныхСредств.СоздатьДокумент();
		ДокументОбъект.Дата = ЭтаДата;
		ДокументОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокументОбъект.Лимиты.Очистить();
		
		НайденыеСтроки = Таблица.НайтиСтроки(Новый Структура("Родитель", Группа));
		Для Каждого НайденнаяСтрока Из НайденыеСтроки Цикл
			
			СуммаЛимита = НайденнаяСтрока.Лимит - НайденнаяСтрока.ТекущийЛимит;
			Если НайденнаяСтрока.Лимит=0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ДокументОбъект.Лимиты.Добавить();
			НоваяСтрока.Подразделение = НайденнаяСтрока.Подразделение;
			НоваяСтрока.Сумма = СуммаЛимита;
			
		КонецЦикла; 
		
		Если ДокументОбъект.Лимиты.Количество()>0 Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);		
		КонецЕсли; 
		
	КонецЦикла; 
		
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЛимиты(Команда)
	
	УстановитьЛимитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПередНачаломИзменения(Элемент, Отказ)
	Если НЕ Элементы.ДеревоДанных.ТекущиеДанные.МожноУстанавливатьЛимит Тогда
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоказать(Команда)
	Элементы.ГруппаНастройки.Видимость = Не Элементы.ГруппаНастройки.Видимость;
	Элементы.ФормаНастройкиПоказать.Пометка = Элементы.ГруппаНастройки.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаКлиенте(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоРекурсивно(Строка, ТекущийУровень, ГраничныйУровень, НадоСвернуть = Истина)
	
	Если ТекущийУровень=ГраничныйУровень Тогда
		Если НадоСвернуть Тогда
			Элементы.ДеревоДанных.Свернуть(Строка.ПолучитьИдентификатор());
		Иначе
			Элементы.ДеревоДанных.Развернуть(Строка.ПолучитьИдентификатор());
		КонецЕсли; 
	Иначе
		МассивСтрок = Строка.ПолучитьЭлементы();
		Для Каждого СтрокаМассива Из МассивСтрок Цикл
			СвернутьДеревоРекурсивно(СтрокаМассива, ТекущийУровень+1, ГраничныйУровень, НадоСвернуть);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеДоУровня(Команда)
	СвернутьДеревоРекурсивно(ДеревоДанных, 0, Число(Прав(Команда.Имя, 1)), Истина);
КонецПроцедуры

&НаКлиенте
Процедура СгрупироватьОрганизацияПодразделение(Команда)
	СтрокаГруппировки = "Организация, Подразделение";
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура СгрупироватьПодразделениеОрганизация(Команда)
	СтрокаГруппировки = "Подразделение, Организация";
	ОбновитьДанные();
КонецПроцедуры
